{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 1, "type": "text", "text": "Table of Contents", "page_start": 1, "page_end": 1, "source_elements": [0]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 2, "type": "title", "text": "PART II", "page_start": 1, "page_end": 1, "source_elements": [1]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 3, "type": "title", "text": "Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.", "page_start": 1, "page_end": 1, "source_elements": [2]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 4, "type": "text", "text": "Stock Trading Symbol PEP. Stock Exchange Listings The Nasdaq Global Select Market is the principal market for our common stock, which is also listed on the SIX Swiss Exchange. Shareholders As of February 2, 2023, there were approximately 98,573 shareholders of record of our common stock. Dividends We have paid consecutive quarterly cash dividends since 1965. The declaration and payment of future dividends are at the discretion of the Board. Dividends are usually declared in February, May, July and November and paid at the end of March, June and September and the beginning of January. On February 1, 2023, the Board declared a quarterly dividend of $1.15 per share payable March 31, 2023, to shareholders of record on March 3, 2023. For the remainder of 2023, the record dates for these dividend payments are expected to be June 2, September 1 and December 1, 2023, subject to the approval of the Board. On February 9, 2023, we announced a 10.0% increase in our annualized dividend to $5.06 per share from $4.60 per share, effective with the dividend expected to be paid in June 2023. We expect to return a total of approximately $7.7 billion to shareholders in 2023, comprising dividends of approximately $6.7 billion and share repurchases of approximately $1.0 billion. For information on securities authorized for issuance under our equity compensation plans, see “Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.” A summary of our common stock repurchases (in millions, except average price per share) during the fourth quarter of 2022 is set forth in the table below.", "page_start": 1, "page_end": 1, "source_elements": [3, 4, 5, 6, 7, 8, 9]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 5, "type": "title", "text": "Issuer Purchases of Common Stock", "page_start": 1, "page_end": 1, "source_elements": [10]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 6, "type": "table", "text": "Total Number of Maximum Number (or Total Shares Purchased as Approximate Dollar Value) of Period Number of Shares Repurchased (a) Average Price Paid Per Share Part of Publicly Announced Plans or Programs Shares that May Yet Be Purchased Under the Plans or Programs 9/3/2022 $ 8,821 9/4/2022 10/1/2022 0.9 $ 168.54 0.9 (153) 8,668 10/2/2022 10/29/2022 0.2 $ 174.47 0.2 (46) 8,622 10/30/2022 11/26/2022 0.4 $ 179.94 0.4 (67) 8,555 11/27/2022 12/31/2022 0.3 $ 182.84 0.3 (55) Total 1.8 $ 174.04 1.8 $ 8,500", "page_start": 1, "page_end": 1, "source_elements": [11]}
{"source_doc": "28", "doc_id": "28_p1", "chunk_id": 7, "type": "text", "text": "(a) All shares were repurchased in open market transactions pursuant to the $10 billion repurchase program authorized by our Board and publicly announced on February 10, 2022, which commenced on February 11, 2022 and will expire on February 28, 2026. Shares repurchased under this program may be repurchased in open market transactions, in privately negotiated transactions, in accelerated stock repurchase transactions or otherwise. 28", "page_start": 1, "page_end": 1, "source_elements": [12, 13]}
