{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 1, "type": "text", "text": "March 9, 2023 BEAUTY", "page_start": 1, "page_end": 1, "source_elements": [0, 1]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 2, "type": "title", "text": "Ulta Beauty Announces Fourth Quarter", "page_start": 1, "page_end": 1, "source_elements": [2]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 3, "type": "text", "text": "Fiscal 2022 Results", "page_start": 1, "page_end": 1, "source_elements": [3]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 4, "type": "title", "text": "Net Sales of $3.2 Billion Compared to $2.7 Billion in the Year Ago Quarter", "page_start": 1, "page_end": 1, "source_elements": [4]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 5, "type": "title", "text": "Comparable Sales Increased 15.6%", "page_start": 1, "page_end": 1, "source_elements": [5]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 6, "type": "title", "text": "Net Income of $340.8 Million or $6.68 Per Diluted Share", "page_start": 1, "page_end": 1, "source_elements": [6]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 7, "type": "text", "text": "BOLINGBROOK, Ill. (BUSINESS WIRE) Ulta Beauty, Inc. (NASDAQ: ULTA) today announced financial results for the thirteen week period (“fourth quarter”) and fifty two week period (“fiscal year”) ended January 28, 2023 compared to the same periods ended January 29, 2022.", "page_start": 1, "page_end": 1, "source_elements": [7]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 8, "type": "table", "text": "13 Weeks Ended 52 Weeks Ended January January January January January January 28, 29, 30, 28, 29, 30, (Dollars in millions, except per share data) 2023 2022 2021 2023 2022 2021 Net sales $ 3,226.8 $ 2,729.4 $ 2,198.7 $ 10,208.6 $ 8,630.9 $ 6,152.0 Comparable sales 15.6% 21.4% (4.8%) 15.6% 37.9% (17.9%) Gross profit (as a percentage of net sales) 37.6% 37.6% 35.1% 39.6% 39.0% 31.7% Selling, general and administrative expenses $ 762.7 $ 650.0 $ 514.1 $ 2,395.3 $ 2,061.5 $ 1,583.0 Operating income (as a percentage of net sales) 13.9% 13.8% 10.2% 16.1% 15.0% 3.9% Diluted earnings per share $ 6.68 $ 5.41 $ 3.03 $ 24.01 $ 17.98 $ 3.11 New store openings, net 12 6 2 47 44 10", "page_start": 1, "page_end": 1, "source_elements": [8]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 9, "type": "text", "text": "“Ulta Beauty’s strong fourth quarter results punctuate an exceptional year with record sales, profitability, and member growth, reflecting robust demand and best in class execution,” said Dave Kimbell, chief executive officer. “For the first time in our 33 year history, Ulta Beauty’s annual revenue surpassed ten billion dollars, our annual net income exceeded one billion dollars, and we exceeded 40 million Ultamate Rewards members. These milestone achievements demonstrate the power of Ulta Beauty’s highly differentiated model, the health of the growing beauty category, and our winning culture and outstanding teams.” Kimbell continued, “As we move into fiscal 2023, we remain optimistic about the strength and resiliency of the beauty category, and I am excited about the opportunities ahead to continue to expand our leadership position, capture market share gains, and drive long term value for all our stakeholders.”", "page_start": 1, "page_end": 1, "source_elements": [9, 10]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 10, "type": "title", "text": "For the Fourth Quarter of Fiscal 2022", "page_start": 1, "page_end": 1, "source_elements": [11]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p1", "chunk_id": 11, "type": "text", "text": "Net sales increased 18.2% to $3.2 billion compared to $2.7 billion in the fourth quarter of fiscal 2021 primarily due to the favorable impact from the continued resilience of the beauty category, retail price increases, and the impact of new brands and product innovation compared to the fourth quarter of fiscal 2021. Comparable sales (sales for stores open at least 14 months and e commerce sales) increased 15.6% compared to an increase of 21.4% in the fourth quarter of fiscal 2021, driven by a 13.6% increase in transactions and a 1.8% increase in average ticket. Gross profit increased 18.0% to $1.2 billion compared to $1.0 billion in the fourth quarter of fiscal 2021. As a percentage of net sales, gross profit of 37.6% was flat compared to the fourth quarter of fiscal 2021, primarily due to leverage of fixed costs, favorable channel mix shifts, and strong growth in other revenue, offset by higher inventory shrink. Selling, general and administrative (SG&A) expenses increased 17.3% to $762.7 million compared to $650.0 million in the fourth quarter of fiscal 2021. As a percentage of net sales, SG&A expenses decreased to 23.6% compared to 23.8% in the fourth quarter of fiscal 2021, primarily due to leverage of marketing expenses and incentive compensation due to higher sales, partially offset by deleverage of store payroll and benefits due to wage investments and deleverage in corporate overhead due to strategic investments. Operating income increased 19.2% to $447.6 million, or 13.9% of net sales, compared to $375.6 million, or 13.8% of net sales, in the fourth quarter of fiscal 2021. The tax rate increased to 24.6% compared to 22.9% in the fourth quarter of fiscal 2021. Net income increased 17.8% to $340.8 million compared to $289.4 million in the fourth quarter of fiscal 2021. Diluted earnings per share increased 23.5% to $6.68, including a $0.02 benefit due to income tax accounting for stock based compensation, compared to $5.41 including a $0.05 benefit due to income tax accounting for stock based compensation, in the fourth quarter of fiscal 2021.", "page_start": 1, "page_end": 2, "source_elements": [12, 13, 14, 15, 16, 17, 18, 19]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p2", "chunk_id": 12, "type": "title", "text": "For the Full Year of Fiscal 2022", "page_start": 2, "page_end": 2, "source_elements": [20]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p2", "chunk_id": 13, "type": "text", "text": "Net sales increased 18.3% to $10.2 billion compared to $8.6 billion in fiscal 2021, primarily due to the favorable impact from the continued resilience of the beauty category, retail price increases, the impact of new brands and product innovation, increased social occasions, and fewer COVID 19 limitations compared to fiscal 2021. Comparable sales increased 15.6% compared to an increase of 37.9% in fiscal 2021, driven by a 10.8% increase in transactions and a 4.3% increase in average ticket. Gross profit increased 20.1% to $4.0 billion compared to $3.4 billion in fiscal 2021. As a percentage of net sales, gross profit increased to 39.6% compared to 39.0% in fiscal 2021, primarily due to leverage of fixed costs, strong growth in other revenue, and favorable channel mix shifts, partially offset by higher inventory shrink and lower merchandise margin. SG&A expenses increased 16.2% to $2.4 billion compared to $2.1 billion in fiscal 2021. As a percentage of net sales, SG&A expenses decreased to 23.5% compared to 23.9% in fiscal 2021, primarily due to lower marketing expenses and leverage of incentive compensation due to higher sales, partially offset by deleverage of corporate overhead due to strategic investments and deleverage of store payroll and benefits due to wage investments. Operating income increased 26.3% to $1.6 billion, or 16.1% of net sales, compared to $1.3 billion, or 15.0% of net sales, in fiscal 2021. The tax rate increased to 24.4% compared to 23.9% in fiscal 2021. Net income increased 26.0% to $1.2 billion compared to $985.8 million in fiscal 2021. Diluted earnings per share increased 33.5% to $24.01, including a $0.07 benefit due to income tax accounting for stock based compensation, compared to $17.98 including a $0.13 benefit due to income tax accounting for stock based compensation, in fiscal 2021.", "page_start": 2, "page_end": 3, "source_elements": [21, 22, 23, 24, 25, 26, 27, 28]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 14, "type": "title", "text": "Balance Sheet", "page_start": 3, "page_end": 3, "source_elements": [29]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 15, "type": "text", "text": "Cash and cash equivalents at the end of the fourth quarter of fiscal 2022 were $737.9 million. Merchandise inventories, net at the end of the fourth quarter of fiscal 2022 totaled $1.6 billion compared to $1.5 billion at the end of the fourth quarter of fiscal 2021. The $104.2 million increase was primarily due to the opening of 47 new stores since January 29, 2022, inventory to support new brand launches and brand expansions, and inventory cost increases.", "page_start": 3, "page_end": 3, "source_elements": [30, 31]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 16, "type": "title", "text": "Share Repurchase Program", "page_start": 3, "page_end": 3, "source_elements": [32]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 17, "type": "text", "text": "During the fourth quarter of fiscal 2022, the Company repurchased 722,457 shares of its common stock at a cost of $328.1 million. During fiscal 2022, the Company repurchased 2.2 million shares of its common stock at a cost of $900.0 million. As of January 28, 2023, $1.1 billion remained available under the $2.0 billion share repurchase program announced in March 2022.", "page_start": 3, "page_end": 3, "source_elements": [33]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 18, "type": "title", "text": "Store Update", "page_start": 3, "page_end": 3, "source_elements": [34]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 19, "type": "text", "text": "Real estate activity in the fourth quarter of fiscal 2022 included 12 new stores located in Garden Grove, CA; Glendale, AZ; Hartsdale, NY; Hollister, CA; Indianapolis, IN; Liverpool, NY; Nanuet, NY; Oklahoma City, OK; Richmond, TX; Rock Springs, WY; Tullahoma, TN; and Woburn, MA. In addition, the Company relocated one store and remodeled 12 stores. During fiscal 2022, the Company opened 47 new stores, relocated 12 stores, and remodeled 20 stores. At the end of the fourth quarter of fiscal 2022, the Company operated 1,355 stores totaling 14.2 million square feet.", "page_start": 3, "page_end": 3, "source_elements": [35, 36]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 20, "type": "title", "text": "Fiscal 2023 Outlook", "page_start": 3, "page_end": 3, "source_elements": [37]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 21, "type": "title", "text": "For fiscal 2023, the Company plans to:", "page_start": 3, "page_end": 3, "source_elements": [38]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 22, "type": "text", "text": "FY23 Outlook", "page_start": 3, "page_end": 3, "source_elements": [39]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 23, "type": "table", "text": "$10.95 billion to $11.05 billion 4% to 5% 25 30 20 30 14.7% to 15.0% $24.70 to $25.40 approximately $900 million approximately 24.6% $400 million to $475 million Depreciation and amortization expense $245 million to $250 million", "page_start": 3, "page_end": 3, "source_elements": [40]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p3", "chunk_id": 24, "type": "text", "text": "Net sales Comparable sales New stores, net Remodel and relocation projects Operating margin Diluted earnings per share Share repurchases Effective tax rate Capital expenditures", "page_start": 3, "page_end": 3, "source_elements": [41, 42, 43, 44, 45, 46, 47, 48, 49]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 25, "type": "title", "text": "Conference Call Information", "page_start": 4, "page_end": 4, "source_elements": [50]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 26, "type": "text", "text": "A conference call to discuss fourth quarter of fiscal 2022 results is scheduled for today, March 9, 2023, at 4:30 p.m. ET / 3:30 p.m. CT. Investors and analysts interested in participating in the call are invited to dial (877) 704 4453. The conference call will also be webcast live at https://ulta.com/investor. A replay of the webcast will remain available for 90 days. A replay of the conference call will be available until 11:59 p.m. ET on March 23, 2023 and can be accessed by dialing (844) 512‑2921 and entering conference ID number 13735500.", "page_start": 4, "page_end": 4, "source_elements": [51]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 27, "type": "title", "text": "About Ulta Beauty", "page_start": 4, "page_end": 4, "source_elements": [52]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 28, "type": "text", "text": "At Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty bringing together All Things Beauty, All in One Place®. Today, Ulta Beauty operates 1,355 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials, and social content. For more information, visit www.ulta.com.", "page_start": 4, "page_end": 4, "source_elements": [53]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 29, "type": "title", "text": "Forward‑Looking Statements", "page_start": 4, "page_end": 4, "source_elements": [54]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p4", "chunk_id": 30, "type": "text", "text": "This press release contains forward looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, which reflect the company’s current views with respect to, among other things, future events and financial performance. These statements can be identified by the use of forward looking words such as “outlook,” “believes,” “expects,” “plans,” “estimates,” “targets,” “strategies” or other comparable words. Any forward looking statements contained in this press release are based upon the company’s historical performance and on current plans, estimates and expectations. The inclusion of this forward looking information should not be regarded as a representation by the company or any other person that the future plans, estimates, targets, strategies or expectations contemplated by the company will be achieved. Such forward looking statements are subject to various risks and uncertainties, which include, without limitation: changes in the overall level of consumer spending and volatility in the economy, including as a result of the COVID 19 pandemic and geo political events; the impact of current inflationary cost pressures on payroll, benefits, supply chain, and other operating costs; our ability to sustain our growth plans and successfully implement our long range strategic and financial plan; the ability to execute our operational excellence priorities, including continuous improvement, Project SOAR (our replacement enterprise resource planning platform), and supply chain optimization; epidemics, pandemics or natural disasters that have and could continue to negatively impact sales; our ability to gauge beauty trends and react to changing consumer preferences in a timely manner; the possibility that we may be unable to compete effectively in our highly competitive markets; the possibility that cybersecurity or information security breaches and other disruptions could compromise our information or result in the unauthorized disclosure of confidential information;", "page_start": 4, "page_end": 5, "source_elements": [55, 56, 57, 58, 59, 60, 61, 62, 63]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p5", "chunk_id": 31, "type": "text", "text": "the possibility of material disruptions to our information systems; the failure to maintain satisfactory compliance with applicable privacy and data protection laws and regulations; the possibility that the capacity of our distribution and order fulfillment infrastructure and the performance of our distribution centers and fast fulfillment centers may not be adequate to support our expected future growth plans; changes in the wholesale cost of our products; a decline in operating results that has and may continue to lead to asset impairment and store closure charges; the possibility that new store openings and existing locations may be impacted by developer or co tenant issues; our ability to attract and retain key executive personnel; the impact of climate change on our business operations and/or supply chain; our ability to successfully execute our common stock repurchase program or implement future common stock repurchase programs; and other risk factors detailed in the company’s public filings with the Securities and Exchange Commission (the SEC), including risk factors contained in its Annual Report on Form 10‑K for the fiscal year ended January 29, 2022, as such may be amended or supplemented in its subsequently filed Quarterly Reports on Form 10 Q. The company’s filings with the SEC are available at www.sec.gov. Except to the extent required by the federal securities laws, the Company does not undertake to publicly update or revise its forward looking statements, whether as a result of new information, future events or otherwise.", "page_start": 5, "page_end": 5, "source_elements": [64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 32, "type": "title", "text": "Ulta Beauty, Inc. Consolidated Statements of Income (In thousands, except per share data)", "page_start": 6, "page_end": 6, "source_elements": [75]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 33, "type": "text", "text": "13 Weeks Ended", "page_start": 6, "page_end": 6, "source_elements": [76]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 34, "type": "table", "text": "Net sales Cost of sales Gross profit Selling, general and administrative expenses Pre opening expenses Operating income Interest (income) expense, net Income before income taxes Income tax expense Net income Net income per common share: Basic Diluted Weighted average common shares outstanding: Basic Diluted January 28, January 29, 2023 2022 (Unaudited) (Unaudited) $ 3,226,773 100.0% $ 2,729,388 2,014,270 62.4% 1,702,059 1,212,503 37.6% 1,027,329 762,706 23.6% 649,968 2,179 0.1% 1,739 447,618 13.9% 375,622 (4,378) (0.1%) 467 451,996 14.0% 375,155 111,245 3.4% 85,789 $ 340,751 10.6% $ 289,366 $ 6.73 $ 5.44 $ 6.68 $ 5.41 50,624 53,163 50,976 53,519 100.0% 62.4% 37.6% 23.8% 0.1% 13.8% 0.1% 13.7% 3.1% 10.6%", "page_start": 6, "page_end": 6, "source_elements": [77]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 35, "type": "title", "text": "Ulta Beauty, Inc. Consolidated Statements of Income (In thousands, except per share data)", "page_start": 6, "page_end": 6, "source_elements": [78]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 36, "type": "text", "text": "52 Weeks Ended", "page_start": 6, "page_end": 6, "source_elements": [79]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 37, "type": "table", "text": "Cost of sales Gross profit Selling, general and administrative expenses Pre opening expenses Operating income Interest (income) expense, net Income before income taxes Income tax expense Net income Net income per common share: Basic Diluted Weighted average common shares outstanding: Basic January 28, January 29, 2023 2022 (Unaudited) $ 10,208,580 100.0% $ 8,630,889 6,164,070 60.4% 5,262,335 4,044,510 39.6% 3,368,554 2,395,299 23.5% 2,061,545 10,601 0.1% 9,517 1,638,610 16.1% 1,297,492 (4,934) 0.0% 1,663 1,643,544 16.1% 1,295,829 401,136 3.9% 309,992 $ 1,242,408 12.2% $ 985,837 $ 24.17 $ 18.09 $ 24.01 $ 17.98 51,403 54,482 100.0% 61.0% 39.0% 23.9% 0.1% 15.0% 0.0% 15.0% 3.6% 11.4%", "page_start": 6, "page_end": 6, "source_elements": [80]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p6", "chunk_id": 38, "type": "text", "text": "Net sales Diluted 51,738 54,841 Exhibit 1 Exhibit 2 Exhibit 3", "page_start": 6, "page_end": 7, "source_elements": [81, 82, 83, 84, 85, 86, 87]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p7", "chunk_id": 39, "type": "title", "text": "Ulta Beauty, Inc. Condensed Consolidated Balance Sheets (In thousands)", "page_start": 7, "page_end": 7, "source_elements": [88]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p7", "chunk_id": 40, "type": "text", "text": "January 28, January 29,", "page_start": 7, "page_end": 7, "source_elements": [89]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p7", "chunk_id": 41, "type": "table", "text": "Assets Current assets: Cash and cash equivalents Receivables, net Merchandise inventories, net Prepaid expenses and other current assets Prepaid income taxes Total current assets Property and equipment, net Operating lease assets Goodwill Other intangible assets, net Deferred compensation plan assets Other long term assets Total assets Liabilities and stockholders’ equity Current liabilities: Accounts payable Accrued liabilities Deferred revenue Current operating lease liabilities Accrued income taxes Total current liabilities Non current operating lease liabilities Deferred income taxes Other long term liabilities Total liabilities Commitments and contingencies 2023 2022 (Unaudited) $ 737,877 $ 199,422 1,603,451 130,246 38,308 2,709,304 1,009,273 1,561,263 10,870 1,312 35,382 43,007 $ $ 559,527 $ 444,278 394,677 283,293 — 1,681,775 1,619,883 55,346 53,596 3,410,600", "page_start": 7, "page_end": 7, "source_elements": [90]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p7", "chunk_id": 42, "type": "text", "text": "431,560 233,682 1,499,218 110,814 5,909 2,281,183 914,476 1,482,256 10,870 1,538 38,409 35,647 5,370,411 $ 4,764,379 552,730 364,797 353,579 274,118 12,786 1,558,010 1,572,638 39,693 58,665 3,229,006 Total stockholders’ equity 1,959,811 1,535,373 Total liabilities and stockholders’ equity $ 5,370,411 $ 4,764,379 Exhibit 4", "page_start": 7, "page_end": 8, "source_elements": [91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 43, "type": "title", "text": "Ulta Beauty, Inc.", "page_start": 8, "page_end": 8, "source_elements": [121]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 44, "type": "title", "text": "Condensed Consolidated Statements of Cash Flows (In thousands)", "page_start": 8, "page_end": 8, "source_elements": [122]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 45, "type": "text", "text": "52 Weeks Ended January 28, January 29, 2023", "page_start": 8, "page_end": 8, "source_elements": [123, 124, 125, 126]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 46, "type": "table", "text": "(Unaudited) $ 1,242,408 $ 985,837 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 241,372 268,460 Non cash lease expense 301,912 276,229 Deferred income taxes 15,653 (25,666) Stock based compensation expense 43,044 47,259 Loss on disposal of property and equipment 6,688 5,358 Change in operating assets and liabilities: Receivables 34,260 (40,573) Merchandise inventories (104,233) (331,003) Prepaid expenses and other current assets (19,432) (3,412) Income taxes (45,182) (35,652) Accounts payable 8,309 66,156 Accrued liabilities 48,249 58,598 Deferred revenue 41,098 79,196 Operating lease liabilities (324,500) (303,914) Other assets and liabilities (7,731) 12,392 1,481,915 1,059,265 (312,126) (172,187) (2,458) (4,297) (314,584) (176,484) (900,033) (1,521,925) 46,011 40,386 (6,992) (15,677) (861,014) (1,497,216) Effect of exchange rate changes on cash and cash equivalents — (56) 306,317 (614,491) 431,560 1,046,051 $ 737,877 $ 431,560", "page_start": 8, "page_end": 8, "source_elements": [127]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 47, "type": "text", "text": "Operating activities Net income Net cash provided by operating activities Investing activities Capital expenditures Other investments Net cash used in investing activities Financing activities Repurchase of common shares Stock options exercised Purchase of treasury shares Net cash used in financing activities Net increase (decrease) in cash and cash equivalents 2022 Cash and cash equivalents at beginning of year Cash and cash equivalents at end of year Exhibit 5", "page_start": 8, "page_end": 8, "source_elements": [128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 48, "type": "title", "text": "Ulta Beauty, Inc. Store Update", "page_start": 8, "page_end": 8, "source_elements": [145]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p8", "chunk_id": 49, "type": "table", "text": "Total stores open Number of stores Number of stores Total stores at beginning of the opened during the closed during the open at Fiscal 2022 quarter quarter quarter end of the quarter 1st Quarter 1,308 10 0 1,318 2nd Quarter 1,318 7 0 1,325 3rd Quarter 1,325 18 0 1,343 4th Quarter 1,343 12 0 1,355", "page_start": 8, "page_end": 8, "source_elements": [146]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 50, "type": "title", "text": "Gross square feet for", "page_start": 9, "page_end": 9, "source_elements": [147]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 51, "type": "table", "text": "Total gross square stores opened or Gross square feet for Total gross square feet at beginning of expanded during the stores closed feet at end of the Fiscal 2022 the quarter quarter during the quarter quarter 1st Quarter 13,770,438 90,905 0 13,861,343 2nd Quarter 13,861,343 61,257 0 13,922,600 3rd Quarter 13,922,600 151,730 0 14,074,330 4th Quarter 14,074,330 126,073 0 14,200,403", "page_start": 9, "page_end": 9, "source_elements": [148]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 52, "type": "title", "text": "Ulta Beauty, Inc. Sales by Category", "page_start": 9, "page_end": 9, "source_elements": [149]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 53, "type": "text", "text": "The following tables set forth the approximate percentage of net sales by primary category:", "page_start": 9, "page_end": 9, "source_elements": [150]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 54, "type": "table", "text": "13 Weeks Ended January 28, January 29, 2023 2022 Cosmetics 40% 41% Haircare products and styling tools 20% 20% Skincare 16% 15% Fragrance and bath 18% 18% Services 3% 3% Accessories and other 3% 3% 100% 100%", "page_start": 9, "page_end": 9, "source_elements": [151]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 55, "type": "table", "text": "52 Weeks Ended January 28, January 29, 2023 2022 Cosmetics 42% 43% Haircare products and styling tools 21% 20% Skincare 17% 17% Fragrance and bath 14% 14% Services 3% 3% Accessories and other 3% 3% 100% 100%", "page_start": 9, "page_end": 9, "source_elements": [152]}
{"source_doc": "ULTABEAUTY_2023Q4_EARNINGS", "doc_id": "ULTABEAUTY_2023Q4_EARNINGS_p9", "chunk_id": 56, "type": "text", "text": "View source version on businesswire.com: https://www.businesswire.com/news/home/20230309005603/en/ Investor Contacts: Kiley Rawlins, CFA Vice President, Investor Relations krawlins@ulta.com Media Contact: Eileen Ziesemer Vice President, Public Relations eziesemer@ulta.com (708) 305 4479 Source: Ulta Beauty, Inc. Exhibit 6", "page_start": 9, "page_end": 9, "source_elements": [153, 154, 155, 156, 157]}
